      *01  TEST01-REC.
           03  TEST01-KEY.
               05  TEST01-ID              PIC  X(4).
           03  TEST01-VALUE.
               05  TEST01-RID             PIC  X(4).
