        01  BC-SET.
            02  BC-DATA     PIC X(16).
            02  FNAME       PIC X(256).
            02  BC-MARGIN   PIC X(2).
            02  BC-SIZE     PIC X(2).
            02  BC-HEIGHT   PIC X(3).
            02  BC-RC       PIC X(1).
